// Вывести на экран четные числа от 1 до N.

int i=1;
int N=45;
while(i<=N)
{
    if (i%2==0)
    {
        System.Console.Write($"{i} ");
    }
    i=i+1;
}

