//  Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
//M = 1; N = 5. -> ""1, 2, 3, 4, 5""
//M = 4; N = 8. -> ""4, 5, 6, 7, 8""

int M = 4;
int N = 8;
for (int i = N; i <= M; i++)
{
    Console.Write($" {i}");
}
for (int i = M; i <= N; i++)
{
    Console.Write($" {i}");
}